In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

# 5.1 Pandas 数据结构介绍

### 5.1.1 Series

In [2]:
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
#创建索引
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [4]:
#索引数据
print (obj2['a'])
obj2[['c','a','d']]

-5

c    3
a   -5
d    4
dtype: int64

In [5]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [6]:
print(obj2*2,"\n",np.exp(obj2))

d     8
b    14
a   -10
c     6
dtype: int64
 d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [7]:
print ('b' in obj2,'\n','e' in obj2)

True
 False

In [8]:
#字典生成Series
sdata = {'Ohio':3500,'Texas':7100,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio       3500
Texas      7100
Oregon    16000
Utah       5000
dtype: int64

In [9]:
states=['California','Ohio','Oregon','Texas']
obj4 = pd.Series(sdata,index=states)
obj4

California        NaN
Ohio           3500.0
Oregon        16000.0
Texas          7100.0
dtype: float64

In [10]:
#检查"NA"值
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [12]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [13]:
obj3+obj4

California        NaN
Ohio           7000.0
Oregon        32000.0
Texas         14200.0
Utah              NaN
dtype: float64

In [14]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio           3500.0
Oregon        16000.0
Texas          7100.0
Name: population, dtype: float64

In [15]:
obj4.name

'population'

In [16]:
obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### 5.1.2 DataFrame

In [17]:
#新建一个df
data={'state':['Ohio','Ohio','Ohio','Nevade','Nevade','Nevade'],'year':[2000,2001,2002,2001,2002,2003],'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = DataFrame(data)
pop = {'nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3 = DataFrame(pop)

In [18]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevade  2001  2.4
4  Nevade  2002  2.9
5  Nevade  2003  3.2

In [19]:
frame3

      nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [20]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [21]:
#行排序,仅仅是一个副本
pd.DataFrame(data,columns=['year','stare','pop'])

   year stare  pop
0  2000   NaN  1.5
1  2001   NaN  1.7
2  2002   NaN  3.6
3  2001   NaN  2.4
4  2002   NaN  2.9
5  2003   NaN  3.2

In [22]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevade  2001  2.4
4  Nevade  2002  2.9
5  Nevade  2003  3.2

In [23]:
#可以新增一行,但是一般不这么做
pd.DataFrame(data,columns=['year','stare','pop','debt'])

   year stare  pop debt
0  2000   NaN  1.5  NaN
1  2001   NaN  1.7  NaN
2  2002   NaN  3.6  NaN
3  2001   NaN  2.4  NaN
4  2002   NaN  2.9  NaN
5  2003   NaN  3.2  NaN

In [24]:
#单独设定索引
frame2 = DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevade  2.4  NaN
five   2002  Nevade  2.9  NaN
six    2003  Nevade  3.2  NaN

In [25]:
#单独提取一列
print (frame2['state'])
print (frame2.year) #一般用这种
#单独提取一行
print (frame2.loc['three'])

one        Ohio
two        Ohio
three      Ohio
four     Nevade
five     Nevade
six      Nevade
Name: state, dtype: object
one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64
year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [26]:
#修改一列,或者增加一列
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevade  2.4  16.5
five   2002  Nevade  2.9  16.5
six    2003  Nevade  3.2  16.5

In [27]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevade  2.4   3.0
five   2002  Nevade  2.9   4.0
six    2003  Nevade  3.2   5.0

In [28]:
#删除一列
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevade  2.4   3.0    False
five   2002  Nevade  2.9   4.0    False
six    2003  Nevade  3.2   5.0    False

In [29]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevade  2.4   3.0
five   2002  Nevade  2.9   4.0
six    2003  Nevade  3.2   5.0

In [30]:
#行和index
print (frame2.columns)
print (frame2.index)
frame2.info()

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, one to six
Data columns (total 4 columns):
year     6 non-null int64
state    6 non-null object
pop      6 non-null float64
debt     6 non-null float64
dtypes: float64(2), int64(1), object(1)
memory usage: 400.0+ bytes

In [31]:
#T转置
frame.T

          0     1     2       3       4       5
state  Ohio  Ohio  Ohio  Nevade  Nevade  Nevade
year   2000  2001  2002    2001    2002    2003
pop     1.5   1.7   3.6     2.4     2.9     3.2

In [32]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevade  2001  2.4
4  Nevade  2002  2.9
5  Nevade  2003  3.2

In [48]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [45]:
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [47]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [52]:
index[1:]

Index(['b', 'c'], dtype='object')

In [53]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [55]:
labels = pd.Index(np.arange(3))
print (labels)
obj2 = Series([1.5, -2.5, 0], index=labels)
print(obj2)

Int64Index([0, 1, 2], dtype='int64')
0    1.5
1   -2.5
2    0.0
dtype: float64

In [56]:
obj2.index is labels

True